clc
clear
%关卡5的合作关系的情况三：一个人去挖矿，另一个人从起点直接到终点
fuzai=1200;s1=10000;s2=200;P1=5;P2=10;deadline=10;
A=[1 2 1 1 1 1 2 2 2 2];Q=[3 4;9 9];n=2;s=0;
k=[1 2 3];%停留时取k=1，行走取k=2，挖矿取k=3
costa1=k(1,2)*(Q(A(1,1),1)+Q(A(1,2),1)+Q(A(1,3),1)+Q(A(1,4),1));%对于从起点直接到终点的玩家，总水消耗量
costa2=k(1,2)*(Q(A(1,1),2)+Q(A(1,2),2)+Q(A(1,3),2)+Q(A(1,4),2));%对于从起点直接到终点的玩家，总食物消耗量
costa0=costa1*P1+costa2*P2;%对于从起点直接到终点的玩家，在起点处至少的资金花费
%对于去挖矿的玩家，其总水消耗量
costb1=k(1,2)*(Q(A(1,1),1)+Q(A(1,2),1)+Q(A(1,3),1)+Q(A(1,7),1)+Q(A(1,8),1))+k(1,3)*(Q(A(1,4),1)+Q(A(1,5),1)+Q(A(1,6),1));
%对于去挖矿的玩家，其总食物消耗量
costb2=k(1,2)*(Q(A(1,1),2)+Q(A(1,2),2)+Q(A(1,3),2)+Q(A(1,7),2)+Q(A(1,8),2))+k(1,3)*(Q(A(1,4),2)+Q(A(1,5),2)+Q(A(1,6),2));
%对于去挖矿的玩家，其收益
w=s2*3;
costb0=costb1*P1+costb2*P2;%对于去挖矿的玩家，在起点处至少的资金花费
cost0=costa0+costb0;%两名玩家在起点处的总资金花费
shengyuzijin=s1+s1+w-cost0;%由两名玩家所组成的队伍的总体剩余资金
