clear ;clc
d=0;
T(1)=25;
t(2)=182;%温区1-5
t(4)=203;%温区6
t(6)=237;%温区7
t(8)=254;%温区8-9
t(10)=25;%温区10-11
t(11)=25;%炉后区
for v=1:1:10000
    for x=1:1:250
        dT=0.002*((t(2)-25)/25*x/10+25-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    for x=251:1975%温区1—5
        dT=0.018*(t(2)-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    for x=1976:2025%5-6之间的间隙
        dT=0.015*((t(4)-t(2))/5*x/10+(t(2)-(t(4)-t(2))/5*1975/10)-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    for x=2026:2330%温区6
        dT=0.019*(t(4)-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    for x=2331:2380%6-7空隙
        dT=0.02*((t(6)-t(4))/5*x/10+(t(4)-(t(6)-t(4))/5*233)-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    for x=2381:2685%温区7
        dT=0.024*(t(6)-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    for x=2686:2735%7-8间隙
        dT=0.022*((t(8)-t(6))/5*x/10+(t(6)-(t(8)-t(6))/5*2685/10)-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    for x=2736:3445%温区8-9 3445
        dT=0.022*(t(8)-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    for x=3446:4355%10左侧
        dT=0.03*((25-t(8))/91*x/10+(t(8)-(25-t(8))/91*3445/10)-T(x))*0.1/(v/1000);%计算温差
        T(x+1)=T(x)+dT;%计算下一时刻温度
    end
    o=1;
    for x=2:4355
        if (T(x)-T(x-1))/0.1*(v/1000)>3 || (T(x)-T(x-1))/0.1*(v/1000)<-3%是否符合条件1、2
            o=0;
        end
    end
    for x=2:4355
        if T(x)-T(x-1)>0
            if T(x)>149.99999999 && T(x-1)<150
                z=x;
            end
            if T(x)>190 && T(x-1)<189.999999999999999
                y=x-1;
            end
        end
    end
    k=((y-z)/10)/(v/1000);
    if k<60 || k>120%判断是否成立条件3
        o=0;
    end
    for x=2:4355
        if T(x)>217 && T(x-1)<216.9999999999999999
            z=x;
        end
        if T(x)<217 && T(x-1)>216.999999999999999
            y=x;
        end
    end
    k=((y-z)/10)/(v/1000);
    if k<40 || k>90%判断是否成立条件4
        o=0;
    end
    g=0;
    for x=1:4355
        if T(x)>g
            g=T(x);
        end
    end
    if g<240 || g>250%判断是否成立条件5
        o=0;
    end
    if o==1
        if (v/1000)>d
            d=(v/1000)%最大速度
        end
    end
end

for x=1:1:250
    dT=0.002*((t(2)-25)/25*x/10+25-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end
for x=251:1975%温区1—5
    dT=0.018*(t(2)-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end
for x=1976:2025%5-6之间的间隙
    dT=0.015*((t(4)-t(2))/5*x/10+(t(2)-(t(4)-t(2))/5*1975/10)-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end
for x=2026:2330%温区6
    dT=0.019*(t(4)-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end
for x=2331:2380%6-7空隙
    dT=0.02*((t(6)-t(4))/5*x/10+(t(4)-(t(6)-t(4))/5*233)-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end
for x=2381:2685%温区7
    dT=0.024*(t(6)-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end
for x=2686:2735%7-8间隙
    dT=0.022*((t(8)-t(6))/5*x/10+(t(6)-(t(8)-t(6))/5*2685/10)-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end
for x=2736:3445%温区8-9 3445
    dT=0.022*(t(8)-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end
for x=3446:4355%10左侧
    dT=0.03*((25-t(8))/91*x/10+(t(8)-(25-t(8))/91*3445/10)-T(x))*0.1/d;%计算温差
    T(x+1)=T(x)+dT;%计算下一时刻温度
end

for i=1:4356
    l(i)=i/10;
end
plot(l(1:i)/d,T(1:i))